# -*- coding: utf-8 -*-
"""
Created on Fri Apr 19 04:13:54 2024

@author: bokun
"""

import pandas as pd

# 데이터 생성
data = {
    'a': []
}


# a 열에 들어갈 데이터
# a_data = [
#     "블리자인", "홈 루덴스", "디자인이음새", "필로스디자인", "디자인,성실한", "한샘리하우스", "티엠디자인", "채운디자인", "티엠디자인", "홈새로이",
#     "홈시크디자인", "디자인토미", "디자인파란", "리바트", "디자인덕", "올리브인테리어", "공간이좋다", "후스인", "케일디자인", "에디인테리어",
#     "웰가디자인", "라포르인테리어", "아이케이디", "모드니인테리어", "미라클인테리어", "디자인큐원", "세나클디자인", "디자인그로우", "단한집디자인",
#     "톤앤무드", "빈채드디자인", "예설디자인", "더패키지", "홈앤안목", "리빙갤러리", "디자인하루", "라온디자인", "수디자인", "카사디자인",
#     "창대디자인", "인테라스", "코어디자인", "봄인테리어", "안도", "라베디자인", "디자인쮸들", "박지희디자인", "에스디자인", "정원인테리어",
#     "제스트디자인", "디자인포스", "더라이브러리", "156스페이스", "디자인홈즈", "디자인이후", "신디자인", "아크몽스튜디오", "더디자인", "리앤씨",
#     "디티알디", "오른인테리어", "콘크리트301", "우일인테리어", "다올디자인", "동산인테리어", "아우어디자인", "주식회사큐브", "포츈디자인", "디자인조은",
#     "아룸디자인", "휴먼인테리어", "다람인테리어", "아름하우징", "가우디디자인", "이룸디자인", "한솔하우징", "디자인그리다", "디자인멜로우", "전인테리어",
#     "팰리스인테리어", "이제디자인", "우아인테리어", "리노디자인", "드림하우스", "터치홈", "디엠디자인", "베네스타", "하우스마일", "루담", "용테리어",
#     "디자인서우", "모던홈인테리어", "디자인포맨", "세원인테리어", "3.3디자인스페이스", "인디자인", "디자인스윕", "디자인스퀘어", "디케이메이크",
#     "와이디자인", "아이바라", "에이치디자인", "모넬로디자인", "에스엘디자인", "꾸미다인", "하얀집인테리어", "미소디자인", "더레드인테리어", "바넘디자인",
#     "인테리어이음", "도월디자인", "편집", "신간인테리어", "오트홈디자인", "DIO디자인", "공감디자인", "영에이디", "박앤서디자인그룹", "디자인 아토",
#     "디자인이즈", "85디자인스튜디오", "위디자인", "카멜레온디자인", "케이디자인", "디자인grow", "신세계디자인", "에스제이디자인", "아파트스토리",
#     "리움디자인", "여백디자인", "디자인로뎀", "온기디자인", "하나디자인", "이안에인테리어", "유마디자인", "연디자인", "지민인테리어", "블루밍까사",
#     "인테리어모빌", "다나디자인", "우진인테리어", "신디자인", "어울림디자인"
# ]

a_data = [
    77215, 98137, 23703, 52327, 69171, 96628, 20806, 52313, 57456, 16127,
    50251, 85011, 36408, 48491, 81779, 50506, 20622, 52821, 61460, 11727,
    62158, 36830, 30280, 64416, 80735, 52734, 24200, 36515, 49607, 54073,
    88774, 48856, 68073, 36490, 37765, 76361, 68348, 16998, 84634, 99656,
    74447, 38407, 84263, 24488, 21484, 74992, 79138, 24843, 62370, 21256,
    65162, 30915, 81185, 61962, 68408, 42321, 50267, 10946, 81998, 34019,
    20330, 50264, 46354, 28288, 69286, 16223, 22050, 24909, 37674, 93553,
    99947, 16254, 87846, 26248, 26727, 11928, 20116, 99282, 23597, 63476,
    54674, 30127, 52491, 93412, 33868, 35248, 44463, 90058, 69429, 19985,
    68829, 10590, 81631, 28251, 22207, 12838, 26684, 61112, 23439, 22243,
    45624, 56454, 67567, 78786, 45745, 54745, 54754, 32432, 54672, 15755,
    45134, 34631, 34643, 54227, 23464, 54548, 78754, 78554, 12455, 32165,
    15465, 24658, 95632, 24587, 79852, 86523, 56216, 68465, 43543, 86462,
    86510, 61231, 10321, 10331, 30133, 23133, 31335, 86422, 87656, 86321,
    87413, 55655, 78912
]

# 'a' 열에 각 데이터를 25번씩 반복하여 추가
for item in a_data:
    data['a'].extend([item] * 25)

# DataFrame 생성
df = pd.DataFrame(data)

# Excel 파일로 저장
df.to_excel("output.xlsx", index=False)

print(df)